Repository: magsoftware/sphinx-intl-example
Catalog: src/locale/*/LC_MESSAGES/basic.po
Languages: pl

source: Basic
pl: Podstawy

source: Basic Features
pl: Funkcje podstawowe

source: create or update po files from pot files.
pl: tworzenie lub aktualizacja plików po z plików pot

source: build mo files from po files.
pl: tworzenie plików mo z plików po

source: Optional features
pl: Funkcje opcjonalne

source: These features depends on the `transifex-client`_ tool. Please refer Installation_ section to install it.
pl: Funkcje te zależą od narzędzia `transifex-client`_. Zapoznaj się z sekcją Instalacja_, aby je zainstalować.

source: create ``.transifexrc`` file from environment variable, without interactive input.
pl: tworzy plik ``.transifexrc`` ze zmiennej środowiskowej, bez interaktywnego wprowadzania danych.

source: create ``.tx/config`` file without interactive input.
pl: tworzy plik ``.tx/config`` bez interaktywnego wprowadzania danych.

source: update ``.tx/config`` file from locale/pot files automatically.
pl: automatycznie aktualizuje plik ``.tx/config`` z plików locale/pot.

source: build mo files from po files in the locale directory.
pl: buduje pliki mo z plików po w katalogu ustawień regionalnych.

source: You need to use `tx` command for below features:
pl: Należy użyć polecenia `tx` dla poniższych funkcji:

source: ``tx push -s`` : push pot (translation catalogs) to transifex.
pl: ``tx push -s`` : wypycha pot (katalogi tłumaczeń) do transifex

source: ``tx pull -l ja`` : pull po (translated catalogs) from transifex.
pl: ``tx pull -l ja`` : zaciąga po (katalogi tłumaczeń) z transifex

source: Installation
pl: Instalacja

source: It is strongly recommended to use virtualenv/venv for this procedure::
pl: Zdecydowanie zaleca się użycie virtualenv/venv dla tej procedury::

source: If you want to use `Optional Features`_, you need install Transifex CLI tool. Please refer to `Installation instructions <https://github.com/transifex/cli#installation>`_.
pl: Jeśli chcesz korzystać z `Opcjonalnych funkcji`_, musisz zainstalować narzędzie Transifex CLI. Zapoznaj się z `Instrukcjami instalacji <https://github.com/transifex/cli#installation>`_.
